{
  "zoom-pan-options": {
    "settings": {
      "zoom-around-cursor": {
        "name": "Zoom around cursor",
        "hint": "Center zooming around cursor. Does not apply to zooming with pageup or pagedown."
      },
      "middle-mouse-pan": {
        "name": "Middle-mouse to pan",
        "hint": "Middle mouse press will pan the canvas, instead of the default of doing nothing."
      },
      "max-zoom-override": {
        "name": "Maximum zoom override",
        "hint": "Override for the maximum zoom scale limit. 3 is the Foundry default (up to x3 scaling)."
      },
      "min-zoom-override": {
        "name": "Minimum zoom override",
        "hint": "Override for the minimum zoom scale limit. 0.333 is the Foundry default (down to x0.333 scaling)."
      },
      "pan-zoom-mode": {
        "name": "Pan/zoom mode",
        "hint": "Mouse: Standard foundry behavior. Zoom with mouse scroll. Rotate with Shift+scroll and Ctrl+scroll.\n||\nTouchpad: Pan with two-finger drag. Zoom with two-finger pinch or Ctrl+scroll. Rotate with Shift+scroll and Ctrl+Shift+scroll.\n||\nAlternative: Pan with two-finger drag or scroll or shift+scroll. Zoom with two-finger pinch or Ctrl+scroll. Rotate with Alt+Shift+scroll and Alt+Ctrl+scroll.",
        "choice_mouse": "Mouse: standard foundry behavior",
        "choice_touchpad": "Touchpad: drag, pinch, rotate with Shift or Ctrl+Shift",
        "choice_alternative": "Alternative: can pan with Shift, rotate while holding Alt"
      },
      "auto-detect-touchpad": {
        "name": "Auto-detect touchpad (BUGGY)",
        "hint": "Will try to auto-detect touchpads;  going with either Mouse or Touchpad depending on result (or Alternative if it was selected).  This feature is buggy and doesn't work for everyone!"
      },
      "invert-vertical-scroll": {
        "name": "Invert vertical scroll",
        "hint": "If set to true, you will scroll up when dragging/scrolling down."
      },
      "zoom-speed-multiplier": {
        "name": "Zoom speed",
        "hint": "Multiplies zoom speed, affecting scaling speed. 0.1 or 10 might be better for some touchpads. 0 for default Foundry behavior (which ignores scroll \"intensity\", and feels worse for touchpads)."
      },
      "pan-speed-multiplier": {
        "name": "Pan speed (for touchpad mode)",
        "hint": "Multiplies pan speed if you're using touchpad/alternative mode. Defaults to 1, which should be close to the pan speed when right-click-dragging the canvas."
      },
      "pad-value-when-dragging": {
        "name": "\"pad\" value when dragging something to the edge of the screen",
        "hint": "When holding down the cursor and moving it towards the edge of the screen, the canvas will pan.  \"pad\" is the distance that will trigger it. Foundry default is 50px."
      },
      "shift-value-when-dragging": {
        "name": "\"shift\" value when dragging something to the edge of the screen",
        "hint": "When holding down the cursor and moving it towards the edge of the screen, the canvas will pan.  \"shift\" is the panning distance in tiles. Foundry default is 3 tiles."
      }
    },
    "keybindings": {
      "toggle-touchpad-mode": {
        "name": "Toggle Mouse/Touchpad Mode"
      },
      "toggle-alternative-mode": {
        "name": "Toggle Mouse/Alternative Mode"
      },
      "notifications": {
        "Mouse": "Zoom/Pan Options: Mouse mode enabled.",
        "Touchpad": "Zoom/Pan Options: Touchscreen mode enabled.",
        "Alternative": "Zoom/Pan Options: Alternative mode enabled."
      }
    }
  }
}